app/controllers/todolists_controller.rb

  	def update
  		list = List.find(params[:id])
  			list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "編集しました！"], ["updated_at", "2019-10-08 09:07:38.661903"], ["id", 1]]